app/controllers/api/v1/boards_controller.rb

SELECT "boards".* FROM "boards"
---
  def index
    boards = Board.all

SELECT  "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    board = Board.find_by(id: params[:id])