app/controllers/api/v1/messages_controller.rb

INSERT INTO "messages" ("content", "user_id", "created_at", "updated_at", "board_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "Hello"], ["user_id", 1], ["created_at", "2017-12-18 18:13:52.840796"], ["updated_at", "2017-12-18 18:13:52.840796"], ["board_id", 2]]
---
  def create
    # Create a message entry in Active Record
    message = Message.create(message_params)

SELECT  "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    board = Board.find_by(id: params[:id])