app/controllers/messages_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "messages" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "Ramy Rukes"], ["user_id", 1], ["created_at", "2017-12-13 20:55:01.565347"], ["updated_at", "2017-12-13 20:55:01.565347"]]
---
  def create
    current_user = User.find(1)

    # Create a message entry in Active Record
    message = current_user.messages.build(message_params)

    # If the message saves, broadcast to the room channel
    if message.save